---
kind: method
id: M:Autodesk.Revit.DB.ViewDisplayModel.Dispose
source: html/15016849-c097-6a21-9e1c-563711bef754.htm
---
# Autodesk.Revit.DB.ViewDisplayModel.Dispose Method

Releases all resources used by the ViewDisplayModel

## Syntax (C#)
```csharp
public void Dispose()
```